import asyncio
import os
from aiogram import Bot

async def main():
    # Данные подтягиваются из настроек Secrets вашего репозитория
    API_TOKEN = os.getenv("BOT_TOKEN")
    CHANNEL_ID = os.getenv("CHANNEL_ID")
    TOPIC_ID = 31 # ID темы в группе

    if not API_TOKEN or not CHANNEL_ID:
        print("Ошибка: Переменные BOT_TOKEN или CHANNEL_ID не настроены в Secrets!")
        return

    # Используем контекстный менеджер для автоматического закрытия сессии
    async with Bot(token=API_TOKEN) as bot:
        MESSAGE_TEXT = """
🚨 Это реально произошло! 🚨
После долгого ожидания игроки и трейдеры получили то, чего так не хватало — удобный сервис сделанный людьми, которые шарят за CS2 🎮💣

Мой реферальный код👇
https://csboard.trade?ref=I9THBZPO

🗑️ Прощаемся с кучей скринов в личке
🔍 Больше не нужно вручную выискивать нужный айтем

🧠 Всё работает элементарно:
✍️ Вводишь название предмета → 📦 находишь нужный вариант → 🔄 меняешься без лишней суеты

🛠️ Функционал уже на старте:
💎 Поиск идёт по предметам, а не по никам и скринам
💰 Цены обновляются и отображаются в разных валютах
🌐 Поддержка нескольких языков — комфорт для всех регионов
🔐 Вход через Google или Steam — быстро и безопасно 🛡️

🎉 И это ещё не всё!
В Telegram-канале проекта прямо сейчас разыгрывают нож 🔪🗡️ —  https://t.me/csboardtrade/11 🎁🔥

Но и это еще не всё ❌
Между своими рефералами я разыграю дополнительно ножик, так что не упусти возможность 😎

Залетай, смотри, пробуй — трейдить в CS2 стало проще 🚀💥
"""

        try:
            await bot.send_message(
                chat_id=CHANNEL_ID, 
                text=MESSAGE_TEXT.strip(),
                message_thread_id=TOPIC_ID,
                disable_web_page_preview=False
            )
            print(f"✅ Успех! Сообщение отправлено в тему {TOPIC_ID} в 14:00 по МСК.")
        except Exception as e:
            print(f"❌ Ошибка при отправке: {e}")
            exit(1) # Сообщаем GitHub, что произошла ошибка

if __name__ == '__main__':
    asyncio.run(main())
