import asyncio
import os
from aiogram import Bot
from dotenv import load_dotenv

# Загружаем настройки
load_dotenv()

API_TOKEN = os.getenv("BOT_TOKEN")
CHANNEL_ID = os.getenv("CHANNEL_ID")
INTERVAL = 3600  # 1 час

MESSAGE_TEXT = """
🚨 Это реально произошло! 🚨
После долгого ожидания игроки и трейдеры получили то, чего так не хватало — удобный сервис сделанный людьми, которые шарят за CS2 🎮💣

Мой реферальный код👇
https://csboard.trade?ref=I9THBZPO

🗑️ Прощаемся с кучей скринов в личке
🔍 Больше не нужно вручную выискивать нужный айтем

🧠 Всё работает элементарно:
✍️ Вводишь название предмета → 📦 находишь нужный вариант → 🔄 меняешься без лишней суеты

🛠️ Функционал уже на старте:
💎 Поиск идёт по предметам, а не по никам и скринам
💰 Цены обновляются и отображаются в разных валютах
🌐 Поддержка нескольких языков — комфорт для всех регионов
🔐 Вход через Google или Steam — быстро и безопасно 🛡️

🎉 И это ещё не всё!
В Telegram-канале проекта прямо сейчас разыгрывают нож 🔪🗡️ —  https://t.me/csboardtrade/11 🎁🔥

Но и это еще не всё ❌
Между своими рефералами я разыграю дополнительно ножик, так что не упусти возможность 😎

Залетай, смотри, пробуй — трейдить в CS2 стало проще 🚀💥
"""

async def main():
    if not API_TOKEN:
        print("Ошибка: Не указан BOT_TOKEN в переменных окружения!")
        return
        
    bot = Bot(token=API_TOKEN)
    print("Бот запущен...")
    
    while True:
        try:
            # Отправка в канал
            await bot.send_message(chat_id=CHANNEL_ID, text=MESSAGE_TEXT.strip())
            print("Пост успешно опубликован!")
        except Exception as e:
            print(f"Ошибка при отправке: {e}")
        
        await asyncio.sleep(INTERVAL)

if __name__ == '__main__':
    asyncio.run(main())
